app/Http/Controllers/PageController.php

    public function getPage($slug)
    {
        $locale = session()->get('locale');
        $fallbackLocale = config('app.fallback_locale');
        $page = Page::whereSlug($slug)->first();
        if (!$page) {
            abort(404);
        }
        $seo_page = Seopage::where('slug', \Request::url());
        if ($seo_page->exists()) {
---
select exists(select * from `seopages` where `slug` = 'http://buldoors.test/page/contacts') as `exists`