app/Providers/AppServiceProvider.php

select exists(select * from `seopages` where `slug` = 'http://buldoors.test/page/contacts') as `exists`
---
    public function boot()
    {
        Schema::defaultStringLength(191);

        view()->composer(['*'], function ($view)
        {
            $seo_page = Seopage::where('slug',\Request::url())->cacheFor(2592000)->cacheTags(['seo_page','seo','seopage']);
            if ($seo_page->exists()){